fixtures/vcr_cassettes/ChartMogul_Subscription/API_Interactions/correctly_interracts_with_the_API.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.chartmogul.com/v1/data_sources
    body:
      encoding: UTF-8
      string: '{"name":"Subscription Test Data api_sub"}'
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      access-control-allow-credentials:
      - 'true'
      content-type:
      - application/json
      date:
      - Thu, 14 Sep 2023 00:45:48 GMT
      content-length:
      - '168'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"uuid":"ds_0c08bbd2-5298-11ee-bc33-d32b6a5410f4","name":"Subscription
        Test Data api_sub","system":"Import API","created_at":"2023-09-14T00:45:48.464Z","status":"idle"}'
    http_version:
  recorded_at: Thu, 14 Sep 2023 00:45:48 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/customers
    body:
      encoding: UTF-8
      string: '{"external_id":"test_cus_ext_id","name":"Test Customer","data_source_uuid":"ds_0c08bbd2-5298-11ee-bc33-d32b6a5410f4"}'
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      access-control-allow-credentials:
      - 'true'
      content-type:
      - application/json
      date:
      - Thu, 14 Sep 2023 00:45:49 GMT
      content-length:
      - '791'
      connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        eyJpZCI6MTE5NDExNjE1LCJ1dWlkIjoiY3VzXzBjNjQxZmMyLTUyOTgtMTFlZS1iYzM0LTdiYWU0YTYxYWIyYiIsImV4dGVybmFsX2lkIjoidGVzdF9jdXNfZXh0X2lkIiwibmFtZSI6IlRlc3QgQ3VzdG9tZXIiLCJlbWFpbCI6IiIsInN0YXR1cyI6Ik5ldyBMZWFkIiwiY3VzdG9tZXItc2luY2UiOm51bGwsImF0dHJpYnV0ZXMiOnsiY3VzdG9tIjp7fSwiY2xlYXJiaXQiOnt9LCJzdHJpcGUiOnt9LCJ0YWdzIjpbXX0sImRhdGFfc291cmNlX3V1aWQiOiJkc18wYzA4YmJkMi01Mjk4LTExZWUtYmMzMy1kMzJiNmE1NDEwZjQiLCJkYXRhX3NvdXJjZV91dWlkcyI6WyJkc18wYzA4YmJkMi01Mjk4LTExZWUtYmMzMy1kMzJiNmE1NDEwZjQiXSwiZXh0ZXJuYWxfaWRzIjpbInRlc3RfY3VzX2V4dF9pZCJdLCJjb21wYW55IjoiIiwiY291bnRyeSI6bnVsbCwic3RhdGUiOm51bGwsImNpdHkiOiIiLCJ6aXAiOm51bGwsImxlYWRfY3JlYXRlZF9hdCI6bnVsbCwiZnJlZV90cmlhbF9zdGFydGVkX2F0IjpudWxsLCJhZGRyZXNzIjp7ImNvdW50cnkiOm51bGwsInN0YXRlIjpudWxsLCJjaXR5IjoiIiwiYWRkcmVzc196aXAiOm51bGx9LCJtcnIiOjAsImFyciI6MCwiYmlsbGluZy1zeXN0ZW0tdXJsIjpudWxsLCJjaGFydG1vZ3VsLXVybCI6Imh0dHBzOi8vYXBwLmNoYXJ0bW9ndWwuY29tLyMvY3VzdG9tZXJzLzExOTQxMTYxNS1UZXN0X0N1c3RvbWVyIiwiYmlsbGluZy1zeXN0ZW0tdHlwZSI6IkltcG9ydCBBUEkiLCJjdXJyZW5jeSI6IkVVUiIsImN1cnJlbmN5LXNpZ24iOiLigqwiLCJvd25lciI6bnVsbH0=
    http_version:
  recorded_at: Thu, 14 Sep 2023 00:45:49 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/plans
    body:
      encoding: UTF-8
      string: '{"name":"Test Plan","interval_count":7,"interval_unit":"day","data_source_uuid":"ds_0c08bbd2-5298-11ee-bc33-d32b6a5410f4"}'
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Thu, 14 Sep 2023 00:45:49 GMT
      etag:
      - W/"b4a44aec60418bac92a91586f03757bb"
      referrer-policy:
      - strict-origin-when-cross-origin
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - 39973e5296ee071c6adbdc120bbe9897
      x-runtime:
      - '0.314313'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '224'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"external_id":"f9321c20-34c5-013c-9c90-027103c7ebee","name":"Test
        Plan","interval_count":7,"interval_unit":"day","data_source_uuid":"ds_0c08bbd2-5298-11ee-bc33-d32b6a5410f4","uuid":"pl_f9321c20-34c5-013c-9c90-027103c7ebee"}'
    http_version:
  recorded_at: Thu, 14 Sep 2023 00:45:49 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/import/customers/cus_0c641fc2-5298-11ee-bc34-7bae4a61ab2b/invoices
    body:
      encoding: UTF-8
      string: '{"invoices":[{"date":"2016-01-01 12:00:00 UTC","currency":"USD","line_items":[{"type":"subscription","subscription_external_id":"test_cus_sub_ext_id","service_period_start":"2016-01-01
        12:00:00 UTC","service_period_end":"2016-02-01 12:00:00 UTC","amount_in_cents":1000,"subscription_set_external_id":"test_cus_set_ext_id","plan_uuid":"pl_f9321c20-34c5-013c-9c90-027103c7ebee"}],"external_id":"test_tr_inv_ext_id"}],"customer_uuid":"cus_0c641fc2-5298-11ee-bc34-7bae4a61ab2b"}'
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Thu, 14 Sep 2023 00:45:50 GMT
      etag:
      - W/"47f40efd6a18696f4b3080d67313f626"
      referrer-policy:
      - strict-origin-when-cross-origin
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - 4048e295630af2de4d84a9b0f757b4a7
      x-runtime:
      - '0.375591'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '897'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"invoices":[{"uuid":"inv_9d62986c-0927-46de-bdba-e21c84d64b5a","date":"2016-01-01T12:00:00.000Z","due_date":null,"errors":{},"external_id":"test_tr_inv_ext_id","currency":"USD","line_items":[{"uuid":"li_f33ba93b-5f95-45df-a58e-cc74853f4a34","external_id":null,"type":"subscription","subscription_uuid":"sub_14dc8bc6-d647-4347-94ca-e30a91af8d78","subscription_external_id":"test_cus_sub_ext_id","prorated":false,"proration_type":null,"service_period_start":"2016-01-01T12:00:00.000Z","service_period_end":"2016-02-01T12:00:00.000Z","subscription_set_external_id":"test_cus_set_ext_id","plan_uuid":"pl_f9321c20-34c5-013c-9c90-027103c7ebee","amount_in_cents":1000,"quantity":1,"discount_code":"","discount_amount_in_cents":0,"tax_amount_in_cents":0,"transaction_fees_in_cents":0,"account_code":"","transaction_fees_currency":null,"discount_description":null,"event_order":null}],"transactions":[]}]}'
    http_version:
  recorded_at: Thu, 14 Sep 2023 00:45:50 GMT
- request:
    method: get
    uri: https://api.chartmogul.com/v1/import/customers/cus_0c641fc2-5298-11ee-bc34-7bae4a61ab2b/subscriptions
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 200
      message: OK
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Thu, 14 Sep 2023 00:45:50 GMT
      etag:
      - W/"d38fb2c47ddf930ad6433dc989b592f4"
      referrer-policy:
      - strict-origin-when-cross-origin
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - b305758480b863341725f64ca5d2270d
      x-runtime:
      - '0.127082'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '516'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"customer_uuid":"cus_0c641fc2-5298-11ee-bc34-7bae4a61ab2b","subscriptions":[{"external_id":"test_cus_sub_ext_id","uuid":"sub_14dc8bc6-d647-4347-94ca-e30a91af8d78","cancellation_dates":[],"subscription_set_external_id":"test_cus_set_ext_id","plan_uuid":"pl_f9321c20-34c5-013c-9c90-027103c7ebee","data_source_uuid":"ds_0c08bbd2-5298-11ee-bc33-d32b6a5410f4"}],"current_page":1,"total_pages":1,"cursor":"MjAyMy0wOS0xNFQwMDo0NTo1MC40MTA0NDAwMDBaJnN1Yl8xNGRjOGJjNi1kNjQ3LTQzNDctOTRjYS1lMzBhOTFhZjhkNzg=","has_more":false}'
    http_version:
  recorded_at: Thu, 14 Sep 2023 00:45:50 GMT
- request:
    method: patch
    uri: https://api.chartmogul.com/v1/import/subscriptions/sub_14dc8bc6-d647-4347-94ca-e30a91af8d78
    body:
      encoding: UTF-8
      string: '{"cancelled_at":"2016-01-15 12:00:00 UTC"}'
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 202
      message: Accepted
    headers:
      cache-control:
      - no-cache
      content-type:
      - application/json; charset=utf-8
      date:
      - Thu, 14 Sep 2023 00:45:51 GMT
      referrer-policy:
      - strict-origin-when-cross-origin
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - b1fd1ecb9eb97d00b3ef0f423d99738c
      x-runtime:
      - '0.195728'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '311'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"external_id":"test_cus_sub_ext_id","uuid":"sub_14dc8bc6-d647-4347-94ca-e30a91af8d78","cancellation_dates":["2016-01-15T12:00:00.000Z"],"plan_uuid":"pl_f9321c20-34c5-013c-9c90-027103c7ebee","customer_uuid":"cus_0c641fc2-5298-11ee-bc34-7bae4a61ab2b","data_source_uuid":"ds_0c08bbd2-5298-11ee-bc33-d32b6a5410f4"}'
    http_version:
  recorded_at: Thu, 14 Sep 2023 00:45:51 GMT
- request:
    method: delete
    uri: https://api.chartmogul.com/v1/data_sources/ds_0c08bbd2-5298-11ee-bc33-d32b6a5410f4
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Authorization:
      - Basic hidden
  response:
    status:
      code: 204
      message: No Content
    headers:
      access-control-allow-credentials:
      - 'true'
      date:
      - Thu, 14 Sep 2023 00:45:51 GMT
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: ''
    http_version:
  recorded_at: Thu, 14 Sep 2023 00:45:51 GMT
recorded_with: VCR 5.1.0
