fixtures/vcr_cassettes/ChartMogul_Subscription/_update_cancellation_dates/when_array_has_time_objects/is_setting_the_cancellation_dates_of_the_subscription.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.chartmogul.com/v1/customers?external_id=test_cus_ext_id
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.15.4
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 200
      message:
    headers:
      server:
      - nginx/1.10.1
      date:
      - Mon, 04 Mar 2019 15:04:12 GMT
      content-type:
      - application/json
      content-length:
      - '889'
      connection:
      - keep-alive
      status:
      - 200 OK
      access-control-allow-credentials:
      - 'true'
    body:
      encoding: UTF-8
      string: '{"entries":[{"id":22661127,"uuid":"cus_b289bb4c-3e6f-11e9-b645-6369759fc9da","external_id":"test_cus_ext_id","name":"Test
        Customer","email":"","status":"Active","customer-since":"2016-01-01T12:00:00+00:00","attributes":{"custom":{},"clearbit":{},"stripe":{},"tags":[]},"data_source_uuid":"ds_99d06d30-3e6f-11e9-b645-837bf5404a47","data_source_uuids":["ds_99d06d30-3e6f-11e9-b645-837bf5404a47"],"external_ids":["test_cus_ext_id"],"company":"","country":null,"state":null,"city":"","zip":null,"lead_created_at":null,"free_trial_started_at":null,"address":{"country":null,"state":null,"city":"","address_zip":null},"mrr":4348,"arr":52176,"billing-system-url":null,"chartmogul-url":"https://app.chartmogul.com/#customers/22661127-Test_Customer","billing-system-type":"Import
        API","currency":"USD","currency-sign":"$"}],"current_page":1,"total_pages":1,"has_more":false,"per_page":200,"page":1}'
    http_version:
  recorded_at: Mon, 04 Mar 2019 15:04:12 GMT
- request:
    method: get
    uri: https://api.chartmogul.com/v1/import/customers/cus_b289bb4c-3e6f-11e9-b645-6369759fc9da/subscriptions
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.15.4
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 200
      message:
    headers:
      server:
      - nginx/1.10.1
      date:
      - Mon, 04 Mar 2019 15:04:12 GMT
      content-type:
      - application/json; charset=utf-8
      transfer-encoding:
      - chunked
      connection:
      - keep-alive
      vary:
      - Accept-Encoding, Accept-Encoding
      x-frame-options:
      - SAMEORIGIN
      x-xss-protection:
      - 1; mode=block
      x-content-type-options:
      - nosniff
      etag:
      - W/"326d93dd0e74d25754ea1611dc13afb0"
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - ce3e2ca1-ac44-4e83-bad3-4418d5b9f99d
      x-runtime:
      - '0.062006'
      strict-transport-security:
      - max-age=15768000
    body:
      encoding: ASCII-8BIT
      string: '{"customer_uuid":"cus_b289bb4c-3e6f-11e9-b645-6369759fc9da","subscriptions":[{"uuid":"sub_c2c97897-f0a0-4448-a035-043d7a19b845","external_id":"test_cus_sub_ext_id","cancellation_dates":[],"plan_uuid":"pl_933aefe0-209d-0137-2188-040113b1c101","data_source_uuid":"ds_99d06d30-3e6f-11e9-b645-837bf5404a47"}],"current_page":1,"total_pages":1}'
    http_version:
  recorded_at: Mon, 04 Mar 2019 15:04:12 GMT
- request:
    method: patch
    uri: https://api.chartmogul.com/v1/import/subscriptions/sub_c2c97897-f0a0-4448-a035-043d7a19b845
    body:
      encoding: UTF-8
      string: '{"cancellation_dates":["2000-01-01 00:00:00 UTC"]}'
    headers:
      User-Agent:
      - Faraday v0.15.4
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 202
      message:
    headers:
      server:
      - nginx/1.10.1
      date:
      - Mon, 04 Mar 2019 15:04:13 GMT
      content-type:
      - application/json; charset=utf-8
      transfer-encoding:
      - chunked
      connection:
      - keep-alive
      x-frame-options:
      - SAMEORIGIN
      x-xss-protection:
      - 1; mode=block
      x-content-type-options:
      - nosniff
      cache-control:
      - no-cache
      x-request-id:
      - d65b3ecf-9fbb-4c4b-b213-cdf17415cbc4
      x-runtime:
      - '0.125522'
    body:
      encoding: UTF-8
      string: '{"uuid":"sub_c2c97897-f0a0-4448-a035-043d7a19b845","external_id":"test_cus_sub_ext_id","cancellation_dates":["2000-01-01T00:00:00.000Z"],"customer_uuid":"cus_b289bb4c-3e6f-11e9-b645-6369759fc9da","plan_uuid":"pl_933aefe0-209d-0137-2188-040113b1c101","data_source_uuid":"ds_99d06d30-3e6f-11e9-b645-837bf5404a47"}'
    http_version:
  recorded_at: Mon, 04 Mar 2019 15:04:13 GMT
- request:
    method: get
    uri: https://api.chartmogul.com/validate_param!?external_id=test_cus_ext_id
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 404
      message: Not Found
    headers:
      date:
      - Thu, 14 Sep 2023 01:56:37 GMT
      x-cascade:
      - pass
      content-length:
      - '13'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: 404 Not Found
    http_version:
  recorded_at: Thu, 14 Sep 2023 01:56:37 GMT
recorded_with: VCR 5.1.0
